# messages.py

# --- СТАРТ ---
MSG_WELCOME = """Добрый день! 
Благодарю за интерес к сообществу Совет директоров. 
Отправляю анкету. Прошу каждого участника заполнить её — это поможет нам лучше понять ваши задачи и формат дальнейшей работы.

https://forms.gle/FSgyERRxLSTEHuiT6

Директорлар кеңесі (Совет директоров) қауымдастығына қызығушылық танытқаныңыз үшін алғыс айтамын.  
Сауалнаманы жіберіп отырмын. Әрбір қатысушыдан оны толтыруды сұраймын — бұл бізге сіздердің міндеттеріңізді және алдағы жұмыс форматын жақсырақ түсінуге көмектеседі."""

MSG_INSTRUCT = """После заполнения анкеты, пожалуйста, напишите в чате:
ГОТОВО ✅

Так мы увидим, что вы завершили регистрацию."""

MSG_AINASH_1 = """Анкетаны толтырғаныңызға рахмет — жауаптарыңызды мұқият қарап шықтым.

Бір маңызды сұрақты нақтылап алсақ:
Сіздің қарамағыңызда қызметкерлер бар ма? ИӘ немесе ЖОҚ деп жауап беріңіз."""

MSG_AINASH_2 = """Спасибо, что заполнили анкету — я внимательно посмотрела ваши ответы.

Давайте уточним один важный вопрос:
«У Вас есть сотрудники в подчинении, ответьте ДА или НЕТ?»"""

# --- ВЕТКА АЛЬЯНС (ЕСТЬ СОТРУДНИКИ) ---
MSG_ALLIANCE_INTRO = "Предлагаю Вам участие в закрытом сообществе Альянс!"

MSG_ALLIANCE_OFFER = """Қазір жаңа қатысушылар үшін арнайы ұсыныс бар:
бірінші ай — 25 000 теңгенің орнына 15 000 теңге,
сонымен қатар формат сізге қаншалықты сәйкес келетінін түсіну үшін қосымша 1 апта тегін қатысу беріледі.
Қосылуға дайынсыз ба? ИӘ деп жазыңыз.
Әзірге өзекті болмаса — ЖОҚ деп жазыңыз.

Сейчас для новых участников действует специальное предложение:
первый месяц — 15 000 тенге вместо 25 000 тенге,
и дополнительно 1 неделя участия бесплатно, чтобы вы могли понять, подходит ли вам формат.
Готовы попробовать? Напишите ДА.
Пока не актуально — напишите НЕТ."""

MSG_ALLIANCE_PAYMENT = """Счет на оплату: https://pay.kaspi.kz/pay/kaqnwjx1

Как произведете оплату, скиньте сюда чек об оплате (картинку или скриншот)."""

MSG_ALLIANCE_CONGRATS = """Мы поздравляем вас! 🙌
Вы теперь полноправный Резидент Альянса Совета Директоров! 
Приглашаем присоединиться к Альянсу в закрытый чат: 
https://chat.whatsapp.com/DQysTniphB61W0h1XfCEcP?mode=gi_t

Важные материалы: 
https://t.me/+Fa8nTxuXTFMzY2Fi"""

# --- ВЕТКА ГИЛЬДИЯ (НЕТ СОТРУДНИКОВ) ---
MSG_GUILD_INTRO = "Предлагаю Вам участие в закрытом сообществе Гильдия!"

MSG_GUILD_OFFER = """Қазір жаңа қатысушылар үшін арнайы ұсыныс бар:
бірінші ай — 15 000 теңгенің орнына 5 000 теңге,
сонымен қатар формат сізге қаншалықты сәйкес келетінін түсіну үшін қосымша 1 апта тегін қатысу беріледі.
Қосылуға дайынсыз ба? ИӘ деп жазыңыз.
Әзірге өзекті болмаса — ЖОҚ деп жазыңыз.

Сейчас для новых участников действует специальное предложение:
первый месяц — 5 000 тенге вместо 15 000 тенге,
и дополнительно 1 неделя участия бесплатно, чтобы вы могли понять, подходит ли вам формат.
Готовы попробовать? Напишите ДА.
Пока не актуально — напишите НЕТ."""

MSG_GUILD_PAYMENT = """Счет на оплату: https://pay.kaspi.kz/pay/kaqnwjx1 (сумма 5000 тг)

Как произведете оплату, скиньте сюда чек об оплате."""

MSG_GUILD_CONGRATS = """Мы поздравляем вас! 🙌
Вы теперь полноправный Резидент Гильдии Совета Директоров! 
Приглашаем присоединиться к Гильдии в закрытый чат: 
https://chat.whatsapp.com/DAnJ5qKs3cwCZA76Al1wie?mode=gi_t

Важные материалы: 
https://t.me/+V_8SAFvaBbwxNjdi"""

# --- ОБЩИЕ ТЕКСТЫ ---
MSG_REFUSAL_LINK = "https://chat.whatsapp.com/BfhWaHKftKJCcRRMc9axWE?mode=gi_t" # Если нажали НЕТ

MSG_OFFERTA_TEXT = """Отлично!
Вместо индивидуального договора у нас действует публичная оферта.
Просим Вас ознакомиться с условиями и подтвердить согласие, ответив:
СОГЛАСНА/СОГЛАСЕН ИЛИ НЕТ"""

# --- ССЫЛКИ НА МЕДИА (ЗАМЕНИ НА СВОИ!) ---
URL_IMG_ALLIANCE_1 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/9dd41b420af5fb182c3084321b6d731ec203e8fc/Alliance_kz.jpg" # Картинка Альянса каз
URL_IMG_ALLIANCE_2 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/9dd41b420af5fb182c3084321b6d731ec203e8fc/Alliance_ru.jpg" # Картинка Альянса рус
URL_IMG_GUILD_1 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/9dd41b420af5fb182c3084321b6d731ec203e8fc/Guild_kz.jpg"   # Картинка Гильдии 1
URL_IMG_GUILD_2 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/9dd41b420af5fb182c3084321b6d731ec203e8fc/Guild_ru.jpg"   # Картинка Гильдии 2

URL_PDF_OFFERTA = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/5fac0a224f7f0df80be99e6809c78a2a74c79b29/Public%20Offer.pdf" # PDF Оферты
NAME_PDF_OFFERTA = "Public_Offer.pdf"

# Подарки в конце (замени ссылки)
URL_GIFT_ALLIANCE_1 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/ad273e03eb7a076ae87ec51f97399587972b556c/Gift_Alliance_kz.pdf"
URL_GIFT_ALLIANCE_2 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/5fac0a224f7f0df80be99e6809c78a2a74c79b29/Gift_Directors_ru.pdf"
URL_GIFT_GUILD_1 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/cefd34fa08ab0da9bd7dc7087012b077386533d8/Gift_Tutors_kz.pdf"
URL_GIFT_GUILD_2 = "https://raw.githubusercontent.com/narimankussainov-dot/bot-images/5fac0a224f7f0df80be99e6809c78a2a74c79b29/Gift_Tutors_ru.pdf"

# СООБЩЕНИЯ ПРИ ПРОВЕРКЕ
MSG_WAIT_FOR_ADMIN = "Ваш чек получен! 🧾\nМенеджер проверяет оплату. Пожалуйста, ожидайте подтверждения (обычно 5-15 минут)."

MSG_PAYMENT_REJECTED = "Сообщение от менеджера:\n" # Сюда добавим текст админа